Repository: leforestier/naval
Catalog: naval/locale/*/LC_MESSAGES/naval.po
Languages: fr

source: Unexpected key {key}.
fr: Clé inattendue {key}.

source: Field is missing.
fr: Champ manquant.

source: Couldn't compute field.
fr: Le champ n'a pas pu être calculé.

source: Incorrect value.
fr: Valeur incorrecte.

source: Item #%s:
fr: Element #%s:

source: Wrong type. Expected {type}. Got {wrong_type} instead.
fr: Type incorrect. {type} attendu. Trouvé {wrong_type}.

source: Wrong type. Expected one of {types}. Got {wrong_type} instead.
fr: Type incorrect. Devrait être parmi {types}. Trouvé {wrong_type}.

source: This value shouldn't be empty.
fr: Cette valeur ne devrait pas être vide.

source: The value is too short. Min length is {min_length}.
fr: Trop court. Longueur minimale: {min_length}.

source: The value is too long. Max length is {max_length}.
fr: Trop long. Longueur maximale: {max_length}.

source: The length should be {length}.
fr: La longueur devrait être {length}.

source: The minimum is {min}.
fr: Le minimum est {min}.

source: The maximum is {max}.
fr: Le maximum est {max}.

source: This should be an integer.
fr: Cela devrait être un entier.

source: This should be a number.
fr: Cela devrait être un nombre.

source: This is not a valid email address.
fr: Ce n'est pas une adresse e-mail valide.

source: This is not a valid domain name.
fr: Ce n'est pas un nom de domaine valide.

source: This is not a valid url.
fr: Ce n'est pas une url valide.
